# Limpieza a realizar

- Columnas, minúscula y sin espacios. -> ((Ok)) 
- **Visit Date** -> Cambiar a tipo fecha. -> ((Ok))
- **Conversion** -> Cambiar a str?? -> ((Ok))
- **Product Category** -> Cambiar a minus. Cambiar fashhion a fashion. -> ((Ok))
- **Product Id** -> Cambiar a num?? -> ((Ok))
- **Product Name** -> Cambiar espacios por '_'. -> ((Ok))
- **Price** -> Tiene 40 nulos (2%). Cambiar ',' por '.' decimal formato americano y cambiar tipo float. -> ((Falta nulos, coma Ok)) 
- **Discount** -> Tiene 40 nulos (2%). Cambiar ',' por '.' decimal formato americano y cambiar tipo float. -> ((Falta nulos, coma Ok)) 
- **Total Value** -> Cambiar ',' por '.' decimal formato americano y cambiar tipo float. -> ((Ok))
- **Payment Method** -> Al parecer tiene 1753 nulos (87.65%), cambiar espacios por '_' y a minuscula. -> ((Falta nulos, resto Ok))
- **Shipping Method** -> Al parecer tiene 1753 nulos (87.65%), cambiar espacios por '_' y a minuscula. -> ((Falta nulos, resto Ok))
- **Customer Age** -> Tiene 40 nulos.
- **Device** -> Cambiar a minusc.
- **Coupon Used** -> Al parecer tiene 1753 nulos (87.65%).
- **Browser** -> Cambiar categorías, están mal escritas.
- **Referral Source** -> Cambiar a minusc.

In [28]:
#Trataiento de datos
import pandas as pd
pd.set_option('display.max_columns',None)  # Lim columnas
#-------------------

In [29]:
df_raw = pd.read_csv ('../data/data_raw.csv') #DF original df_raw
df_raw.sample(5)

,User Id,Group,Visit Date,Conversion,Product Category,Product Id,Product Name,Quantity,Price,Discount,Total Value,Payment Method,Shipping Method,Region,Customer Age,Customer Gender,Device,Session Duration,Coupon Used,Browser,Referral Source
684,685,B,2022-02-17,0,SPORTS,P1962,Football,0,"192,36","0,21","0,0",NaN,NaN,Central,35.0,F,TABLET,14,NaN,Eddddge,Email
1489,1490,A,2022-03-21,0,TOYS,P1605,Action Figure,0,"35,63","0,2","0,0",NaN,NaN,South,64.0,M,Desktop,15,NaN,Chrooome,Organic
1499,1500,B,2022-01-29,0,HOME,P1600,Sofa,0,"186,91","0,19","0,0",NaN,NaN,Central,25.0,M,Desktop,17,NaN,Safaaaaari,Email
1462,1463,A,2022-02-26,0,SPORTS,P1560,Gym Bag,0,"264,35","0,1","0,0",NaN,NaN,East,29.0,F,Desktop,13,NaN,Ottttther,Email
812,813,A,2022-01-30,0,SPORTS,P1270,Running Shoes,0,"215,59","0,01","0,0",NaN,NaN,West,30.0,F,Mobile,12,NaN,Firefoxxxxxx,Social

---
## Limpieza

### - Copia de DF para no miodificar el original

In [30]:
df = df_raw.copy()

### 1- Cambio columnas, minúscula y sin espacios

In [31]:
df.columns = df.columns.str.replace(' ','_').str.lower()

In [32]:
df.columns

Index(['user_id', 'group', 'visit_date', 'conversion', 'product_category',
       'product_id', 'product_name', 'quantity', 'price', 'discount',
       'total_value', 'payment_method', 'shipping_method', 'region',
       'customer_age', 'customer_gender', 'device', 'session_duration',
       'coupon_used', 'browser', 'referral_source'],
      dtype='object')

### 2- Cambio visit_date a fecha

In [33]:
#pd.to_datetime(df['visit_date'], format='%Y-%m-%d') piso la columna original
df['visit_date'] = pd.to_datetime(df['visit_date'], format='%Y-%m-%d')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   object
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   object
 9   discount          1960 non-null   object
 10  total_value       2000 non-null   object
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(4), object(15)
memory usage: 328.3+ KB

### 3- Conversión a STR

In [ ]:
df['conversion_str'] = df['conversion'].apply(lambda x: 'yes' if x==1 else 'no') #Nueva columna STR para comparar conversión

In [35]:
df.sample(5)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
919,920,A,2022-03-25,0,HOME,P1679,Lamp,0,"374,74","0,27","0,0",NaN,NaN,North,70.0,F,Desktop,22,NaN,Safaaaaari,Social,no
930,931,A,2022-01-18,0,BEAUTY,P1754,Lipstick,0,"102,37","0,09","0,0",NaN,NaN,South,64.0,F,TABLET,23,NaN,Firefoxxxxxx,Social,no
914,915,B,2022-03-09,0,SPORTS,P1401,Tennis Racket,0,"68,01","0,05","0,0",NaN,NaN,Central,49.0,M,TABLET,23,NaN,Firefoxxxxxx,PAID,no
1354,1355,A,2022-02-21,1,TOYS,P1281,Puzzle,1,"68,55","0,1","61,7",PayPal,Express,East,68.0,F,TABLET,4,No,Eddddge,Email,yes
313,314,B,2022-03-22,0,ELECTRONICS,P1722,Headphones,0,"868,86","0,24","0,0",NaN,NaN,East,66.0,F,Mobile,10,NaN,Chrooome,Email,no

In [36]:
df.loc[:, ['conversion','conversion_str']] #Compruebo

      conversion conversion_str
0              0             no
1              0             no
2              0             no
3              1            yes
4              0             no
...          ...            ...
1995           0             no
1996           0             no
1997           0             no
1998           0             no
1999           0             no

[2000 rows x 2 columns]

### 4- Product Category, cambiar a minus y Cambiar fashhion a fashion.

In [41]:
df['product_category'] = df['product_category'].str.lower()

In [44]:
df['product_category'] = df['product_category'].str.replace('fashhion','fashion')
#df.sample(5)

### 5- Product Id, cambiar a num

In [ ]:
#Quito P y cambio a int
df['product_id'] = df['product_id'].str.replace('P','')
df['product_id'] = df['product_id'].astype('int64')
#df.sample()
#df.info()

### 6- Product Name, cambiar espacios por _

In [50]:
df['product_name'] = df['product_name'].str.replace(' ','_')

In [ ]:
#pasar a minusculas, como ya lo hice antes, en lugar de df['product_name'] = df['product_name'].str.lower() creo funcion para reutilizar

#//// FUNCION CAMBIAR A MINUSCULA ////

def minus (df, col):
    df[col] = df[col].str.lower()

In [55]:
#llamado a la funcion
minus(df, 'product_name')

In [56]:
df.sample(5)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
1382,1383,B,2022-02-28,0,sports,1629,gym_bag,0,"129,94","0,06","0,0",NaN,NaN,Central,29.0,F,TABLET,13,NaN,Chrooome,Social,no
1872,1873,B,2022-02-08,1,home,1217,sofa,4,"357,12","0,03","1385,63",Credit Card,Same day,South,51.0,F,Mobile,21,No,Safaaaaari,PAID,yes
275,276,B,2022-02-07,0,books,1384,science_fiction,0,"30,97","0,19","0,0",NaN,NaN,South,51.0,M,TABLET,27,NaN,Ottttther,PAID,no
13,14,A,2022-02-14,0,fashion,1513,sneakers,0,"146,86","0,08","0,0",NaN,NaN,South,27.0,F,TABLET,2,NaN,Ottttther,PAID,no
1438,1439,A,2022-01-19,0,beauty,1727,mascara,0,"110,32","0,29","0,0",NaN,NaN,East,63.0,F,TABLET,17,NaN,Chrooome,Social,no

### 7- Price, tiene 40 nulos (2%). Cambiar ',' por '.' decimal formato americano y cambiar tipo float. (Aún no trabajo nulos)

In [ ]:
#Como hay que usarlo 3 veces para price, discount y total value, creo una función en lugar de repetir código.
#df['price'] = df['price'].str.replace(',','.')
#df['price'] = df['price'].astype('float64')

#//// FUNCION CAMBIAR , POR . ////

def comas (df, col):
    df[col] = df[col].str.replace(',','.')
    df[col] = df[col].astype('float64')

In [ ]:
comas(df, 'price')

8/9- discount y total_valuem cambiar ',' por '.' decimal formato americano y cambiar tipo float. (Aún no trabajo nulos)

In [68]:
comas(df, 'discount')
comas(df, 'total_value')

In [69]:
df.sample(5)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
345,346,B,2022-02-17,0,toys,1201,doll,0,80.97,0.19,0.00,NaN,NaN,North,49.0,F,TABLET,1,NaN,Eddddge,Organic,no
1291,1292,A,2022-02-10,0,electronics,1202,headphones,0,572.62,0.27,0.00,NaN,NaN,West,20.0,M,Desktop,29,NaN,Firefoxxxxxx,Organic,no
1546,1547,B,2022-02-05,0,fashion,1485,dress,0,20.78,0.13,0.00,NaN,NaN,West,33.0,M,Desktop,9,NaN,Eddddge,PAID,no
1297,1298,A,2022-01-30,0,home,1986,table,0,461.64,0.01,0.00,NaN,NaN,North,27.0,M,Desktop,13,NaN,Safaaaaari,Organic,no
1201,1202,A,2022-02-22,1,electronics,1855,camera,2,885.99,0.18,1453.02,Credit Card,Express,East,69.0,F,TABLET,29,No,Chrooome,Social,yes

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   int64
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   float64
 9   discount          1960 non-null   float64
 10  total_value       2000 non-null   float64
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
 21  conversion_str    2000 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(5), object(12)
memory usage: 343.9+ KB

### 10- Payment Method, cambiar espacios por '_'. 

### 11- Shipping Method, cambiar espacios por '_'.

In [ ]:
#Creo funcion para reutiliza y ya lo hice antes con product_name df['product_name'] = df['product_name'].str.replace(' ','_')
#//// FUNCION CAMBIAR ESPACIOS POR _ ////

def espacios (df, col):
    df[col] = df[col].str.replace(' ','_')

In [75]:
espacios(df, 'payment_method')

In [76]:
espacios(df, 'shipping_method')

In [80]:
#Utilizo la función minúscula

minus(df, 'payment_method') 
minus(df, 'shipping_method')

In [84]:
df.sample(5)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
339,340,A,2022-01-11,1,books,1238,novel,5,28.52,0.02,139.75,cash_on_delivery,express,North,32.0,F,Desktop,29,Yes,Firefoxxxxxx,Email,yes
373,374,B,2022-01-21,0,books,1622,science_fiction,0,31.40,0.11,0.00,NaN,NaN,East,57.0,M,Mobile,21,NaN,Safaaaaari,Organic,no
476,477,A,2022-02-16,0,beauty,1368,mascara,0,57.41,0.16,0.00,NaN,NaN,South,50.0,M,Mobile,4,NaN,Eddddge,Social,no
237,238,A,2022-01-16,0,toys,1716,action_figure,0,58.47,0.27,0.00,NaN,NaN,North,45.0,M,Desktop,24,NaN,Firefoxxxxxx,Email,no
1377,1378,B,2022-01-14,0,home,1264,chair,0,79.34,0.18,0.00,NaN,NaN,South,27.0,Other,Desktop,25,NaN,Chrooome,Organic,no

desde 39.